vpinball/pinmame/src/sound/tms320av120.c
/**********************************************************************************************
 *
 *   Texas Instruments TMS320AV120 MPG Decoder
 *   by Steve Ellenoff
 *   10/14/2003
 *
 *   MPEG Decoding based on the book:
*    "The Programmer's Guide to Sound" by Tim Kientzle (see copyright below)
 **********************************************************************************************/ 
/**********************************************************************************************
 *   NOTE: Supports ONLY MPEG1 Layer 2 Mono data @ 32KHz/32kbps at this time!
 *         Not configurable to anything else, for speed purposes and coding simplicity at this time!
 *         Seems to be fine in practice: scanning the frame headers of Kingpin's sample
 *         ROMs (u28/u29/u30/u31) with 20130 frames, every single one is MPEG1 Layer 2 32kbps
 *         32kHz mono, so the format is constant and a general decoder would buy nothing here AFAIK.
 *
 *   TODO:
 *		   1) Not sure where to set BOF line properly
 *		   2) Not sure of best pcm buffer size and prebuffer size values (nor when best to put SREQ low again)
 **********************************************************************************************/


//MPEG DECODING:    "The Programmer's Guide to Sound" by Tim Kientzle
/***********************************************************************************************
   Copyright 1997 Tim Kientzle.  All rights reserved.

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are
met:

1. Redistributions of source code must retain the above copyright
   notice, this list of conditions and the following disclaimer.
2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.
3. All advertising materials mentioning features or use of this software
   must display the following acknowledgement:
      This product includes software developed by Tim Kientzle
      and published in ``The Programmer's Guide to Sound.''
4. Neither the names of Tim Kientzle nor Addison-Wesley
   may be used to endorse or promote products derived from this software
   without specific prior written permission.

THIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESS OR IMPLIED
WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL TIM KIENTZLE OR ADDISON-WESLEY BE LIABLE FOR
ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT
OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR
BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
**********************************************************************************************/

#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include "driver.h"
#include "tms320av120.h"


//#define VERBOSE

#ifdef VERBOSE
#define LOG(x)	logerror x
//define LOG(x)	printf x
#else
#define LOG(x)
#endif

/**********************************************************************************************
     DECLARATIONS
***********************************************************************************************/
//MPG Stuff
INLINE int Layer2Requant(int sample, int levels, int scaleIndex);
static void Matrix(int V[64], int subbandSamples[32], int numSamples);
static void Layer12Synthesis(int num, int subbandSamples[32], int numSubbandSamples);
static int GetBits(int num, int numBits);
static void DecodeLayer2(int num);

//TMS320AV120 Stuff
static void tms320av120_update(int num, INT16 *buffer, int length);
static void set_bof_line(int chipnum, int state);
static void set_sreq_line(int chipnum, int state);
static int valid_header(int chipnum);

/**********************************************************************************************
     CONSTANTS
***********************************************************************************************/
#define MPG_HEADERSIZE				4			//Mpeg1 - Layer 2 Header Size
#define MPG_FRAMESIZE				140			//Mpeg1 - Layer 2 Framesize @ 32KHz/32kbps (excluding header)
#define CAP_PCMBUFFER_SIZE			(1152*10)	//# of Samples to hold (1 Frame = 1152 Samples)
#define CAP_PREBUFFER_SIZE			(1152*2)	//# of decoded samples needed before we begin to output pcm

#define	LOG_DATA_IN					0			//Set to 1 to log data input to an mp3 file

/**********************************************************************************************
     INTERNAL DATA STRUCTURES
***********************************************************************************************/
struct TMS320AV120Chip
{
 UINT8	framebuff[MPG_FRAMESIZE];		//Holds raw mpg data for 1 frame (also used as header input buffer)
 UINT8	fb_pos;							//Current frame buffer position
 INT16	pcmbuffer[CAP_PCMBUFFER_SIZE];	//Decoded PCM data buffer
 UINT32 pcm_pos;						//Position of next data to be input into the pcm buffer
 UINT32 sOut;							//Position of next sample to read out of the pcm buffer
 int	stream;							//Holds stream channel assignment
 int	bitsRemaining;					//Keep track of # of bits we've read from frame buffer
 int	V[16][64];						//Synthesis window for single channel
 int	mute;							//Mute status ( 0 = off, 1 = Mute )
 int	reset;							//Reset status( 0 = off, 1 = Reset)
 int	bof_line;						//BOF Line status
 int	sreq_line;						//SREQ Line status
 int	found_header;					//Did we find a valid header yet?
 int	prebuff_full;					//If 1, prebuffer full so ok to output pcm
};

//Layer 2 Quantization
typedef struct {
   unsigned short _levels;  // Number of levels
   unsigned char _bits;     // bits to read
   unsigned char _grouping; // Yes->decompose into three samples
} Layer2QuantClass;

