vpinball/pinmame/src/sound/tms320av120.c
//Different Quantization types
//Allocation Table
static const Layer2QuantClass l2allocationE[] = {
   {0,0,0},
   /*l2qc3*/{3,5,1},/*l2qc5*/{5,7,1},
   /*l2qc7{7,3,0},*/ // Not used for our specific sampling frequencies
   /*l2qc9*/{9,10,1},
   /*l2qc15*/{15,4,0},/*l2qc31*/{31,5,0},/*l2qc63*/{63,6,0},/*l2qc127*/{127,7,0},/*l2qc255*/{255,8,0},/*l2qc511*/{511,9,0},/*l2qc1023*/{1023,10,0},/*l2qc2047*/{2047,11,0},
   /*l2qc4095*/{4095,12,0},/*l2qc8191*/{8191,13,0},/*l2qc16383*/{16383,14,0},/*l2qc32767*/{32767,15,0}
   /*l2qc65535{65535,16,0}*/ // Not used for our specific sampling frequencies
};

// 11 active subbands
// Mono requires 38 bits for allocation table
// Used at lowest bit rates 
static const unsigned char Layer2AllocationB2d[32] = { // number of Bits
   4, 4, 3,
   3, 3, 3,
   3, 3, 3,
   3, 3, 3,
   0,0,0,0,0,0,0,0,0,0,
   0,0,0,0,0,0,0,0,0,0
};

static const int SynthesisWindowCoefficients[] = // 2.16 fixed-point values
{0, -1, -1, -1, -1, -1, -1, -2, -2, -2, -2, -3, -3, -4, -4, -5, -5, -6,
-7, -7, -8, -9, -10, -11, -13, -14, -16, -17, -19, -21, -24, -26,

-29, -31, -35, -38, -41, -45, -49, -53, -58, -63, -68, -73, -79,
-85, -91, -97, -104, -111, -117, -125, -132, -139, -147, -154, -161,
-169, -176, -183, -190, -196, -202, -208,

213, 218, 222, 225, 227, 228, 228, 227, 224, 221, 215, 208, 200, 189,
177, 163, 146, 127, 106, 83, 57, 29, -2, -36, -72, -111, -153, -197,
-244, -294, -347, -401,

-459, -519, -581, -645, -711, -779, -848, -919, -991, -1064, -1137,
-1210, -1283, -1356, -1428, -1498, -1567, -1634, -1698, -1759, -1817,
-1870, -1919, -1962, -2001, -2032, -2057, -2075, -2085, -2087, -2080,
-2063,

2037, 2000, 1952, 1893, 1822, 1739, 1644, 1535, 1414, 1280, 1131, 970,
794, 605, 402, 185, -45, -288, -545, -814, -1095, -1388, -1692, -2006,
-2330, -2663, -3004, -3351, -3705, -4063, -4425, -4788,

-5153, -5517, -5879, -6237, -6589, -6935, -7271, -7597, -7910, -8209,
-8491, -8755, -8998, -9219, -9416, -9585, -9727, -9838, -9916, -9959,
-9966, -9935, -9863, -9750, -9592, -9389, -9139, -8840, -8492, -8092,
-7640, -7134,

6574, 5959, 5288, 4561, 3776, 2935, 2037, 1082, 70, -998, -2122,
-3300, -4533, -5818, -7154, -8540, -9975, -11455, -12980, -14548,
-16155, -17799, -19478, -21189, -22929, -24694, -26482, -28289,
-30112, -31947, -33791, -35640,

-37489, -39336, -41176, -43006, -44821, -46617, -48390, -50137,
-51853, -53534, -55178, -56778, -58333, -59838, -61289, -62684,
-64019, -65290, -66494, -67629, -68692, -69679, -70590, -71420,
-72169, -72835, -73415, -73908, -74313, -74630, -74856, -74992,

75038, 74992, 74856, 74630, 74313, 73908, 73415, 72835, 72169, 71420,
70590, 69679, 68692, 67629, 66494, 65290, 64019, 62684, 61289, 59838,
58333, 56778, 55178, 53534, 51853, 50137, 48390, 46617, 44821, 43006,
41176, 39336,

37489, 35640, 33791, 31947, 30112, 28289, 26482, 24694, 22929, 21189,
19478, 17799, 16155, 14548, 12980, 11455, 9975, 8540, 7154, 5818,
4533, 3300, 2122, 998, -70, -1082, -2037, -2935, -3776, -4561, -5288,
-5959,

6574, 7134, 7640, 8092, 8492, 8840, 9139, 9389, 9592, 9750, 9863, 9935,
9966, 9959, 9916, 9838, 9727, 9585, 9416, 9219, 8998, 8755, 8491,
8209, 7910, 7597, 7271, 6935, 6589, 6237, 5879, 5517,

5153, 4788, 4425, 4063, 3705, 3351, 3004, 2663, 2330, 2006, 1692,
1388, 1095, 814, 545, 288, 45, -185, -402, -605, -794, -970, -1131,
-1280, -1414, -1535, -1644, -1739, -1822, -1893, -1952, -2000,

2037, 2063, 2080, 2087, 2085, 2075, 2057, 2032, 2001, 1962, 1919, 1870,
1817, 1759, 1698, 1634, 1567, 1498, 1428, 1356, 1283, 1210, 1137,
1064, 991, 919, 848, 779, 711, 645, 581, 519,

459, 401, 347, 294, 244, 197, 153, 111, 72, 36, 2, -29, -57, -83,
-106, -127, -146, -163, -177, -189, -200, -208, -215, -221, -224,
-227, -228, -228, -227, -225, -222, -218,

213, 208, 202, 196, 190, 183, 176, 169, 161, 154, 147, 139, 132, 125,
117, 111, 104, 97, 91, 85, 79, 73, 68, 63, 58, 53, 49, 45, 41, 38, 35,
31,

29, 26, 24, 21, 19, 17, 16, 14, 13, 11, 10, 9, 8, 7, 7, 6, 5, 5, 4, 4,
3, 3, 2, 2, 2, 2, 1, 1, 1, 1, 1, 1};

/**********************************************************************************************
     GLOBALS
***********************************************************************************************/

static struct TMS320AV120Chip tms320av120[MAX_TMS320AV120];			// Each Chip
static const struct TMS320AV120interface *intf;						// Pointer to the interface

//LUTs
static int layer1ScaleFactors[64];									// MPG Layer 1 Scale Factors
static const UINT8 bitmasks[] = {0,1,3,7,0xF,0x1F,0x3F,0x7F,0xFF};	// Bit reading masks
//Matrix stuff/LUTs
static const UINT8 order[] = {0,16,8,24,4,20,12,28,2,18,10,26,6,22,14,30,1,17,9,25,5,21,13,29,3,19,11,27,7,23,15,31};
static int phaseShiftsR[32], phaseShiftsI[32]; // 1.14
static int vShiftR[64], vShiftI[64]; // 1.13
static int D[512];

#if LOG_DATA_IN	
static FILE *fp;	//For logging
#endif

/**********************************************************************************************
     MPEG DATA HANDLING
***********************************************************************************************/

// return 2.16 requantized and scaled value
INLINE int Layer2Requant(int sample, int levels, int scaleIndex) {
   return (layer1ScaleFactors[scaleIndex] * (((sample+sample+1 - levels)<<15)/levels)) >> 14;
}

// subbandSamples input are 2.16
static void Matrix(int V[64], int subbandSamples[32], int numSamples) {
   int n,size;
   int *workR=V; // Re-use V as work storage
   int workI[64]; // Imaginary part
   int *pWorkR;
   int *pWorkI;
   int phaseShiftStep = 8;

   for(n=numSamples;n<32;n++)
      subbandSamples[n]=0;

   // The initialization step here precalculates the
   // two-point transforms (each two inputs generate four outputs)
   // I'm taking advantage of the fact that my inputs are all real
   pWorkR = workR; // 2.16
   pWorkI = workI; // 2.16

   for(n=0;n<32;n+=2) {
      int a = subbandSamples[order[n]];
      int b = subbandSamples[order[n+1]];
      *pWorkR++ = a+b;  *pWorkI++ = 0; 
      *pWorkR++ = a;    *pWorkI++ = b; 
      *pWorkR++ = a-b;  *pWorkI++ = 0; 
      *pWorkR++ = a;    *pWorkI++ = -b;
   }

   // This is a fast version of the transform in the ISO standard.
   // It's derived using the same principles as the FFT,
   // but it's NOT a Fourier Transform.

