vpinball/pinmame/src/sound/tms320av120.c
   // In each iteration, I throw out one bit of accuracy
   // This gives me an extra bit of headroom to avoid overflow
   for(size=4; size<64; size*=2) {
      int phaseShiftIndex, fftStep;
      // Since the first phase shift value is always 1,
      // I can save a few multiplies by duplicating the loop
      for(n=0; n < 64; n += 2*size) {
         int tR, tI;
         tR = workR[n+size];
         workR[n+size] = (workR[n] - tR)>>1;
         workR[n] = (workR[n] + tR)>>1;
         tI = workI[n+size];
         workI[n+size] = (workI[n] - tI)>>1;
         workI[n] = (workI[n] + tI)>>1;
      }
      phaseShiftIndex = phaseShiftStep;
      for(fftStep = 1; fftStep < size; fftStep++) {
         int phaseShiftR = phaseShiftsR[phaseShiftIndex];
         int phaseShiftI = phaseShiftsI[phaseShiftIndex];
         phaseShiftIndex += phaseShiftStep;
         for(n=fftStep; n < 64; n += 2*size) {
            int tR, tI;
            tR = (phaseShiftR*workR[n+size] 
                     - phaseShiftI*workI[n+size])>>14;
            tI = (phaseShiftR*workI[n+size] 
                     + phaseShiftI*workR[n+size])>>14;
            workR[n+size] = (workR[n] - tR)>>1;
            workI[n+size] = (workI[n] - tI)>>1;
            workR[n] = (workR[n] + tR)>>1;
            workI[n] = (workI[n] + tI)>>1;
         }
      }
      phaseShiftStep /= 2;
   }

   // Build final V values by massaging transform output
   {
      // Now build V values from the complex transform output
      int *pcmR = workR+33; // 6.12
      int *pcmI = workI+33; // 6.12
      V[16] = 0;    // V[16] is always 0
      for(n=1;n<32;n++) {   // V is the real part, V is 6.9
         V[n+16] = (vShiftR[n] * *pcmR++ - vShiftI[n] * *pcmI++)>>15;
      }
      V[48] = (-workR[0])>>1;   // vShift[32] is always -1
      // Exploit symmetries in the result
      for(n=0;n<16;n++) V[n] = -V[32-n];
      for(n=1;n<16;n++) V[48+n] = V[48-n];
   }
}

//Convert Layer 1 or Layer 2 subband samples into pcm samples and put into pcm buffer
static void Layer12Synthesis(int num,
                             int subbandSamples[32],
                             int numSubbandSamples)
{
   INT16 *pcmSamples = &(tms320av120[num].pcmbuffer[tms320av120[num].pcm_pos]);
   int i,j;
   const int *nextD = D;
   int t[64];
   memcpy(t, tms320av120[num].V[15], 64*sizeof(int));

   for(i=15;i>0;i--) // Shift V buffers over
      memcpy(tms320av120[num].V[i], tms320av120[num].V[i-1], 64*sizeof(int));
   memcpy(tms320av120[num].V[0], t, 64*sizeof(int));

   // Convert subband samples into PCM samples in V[0]
   Matrix(tms320av120[num].V[0],subbandSamples,numSubbandSamples);

   // D is 3.12, V is 6.9, want 16 bit output
   for(j=0;j<32;j++) {
      int sample = 0; // 8.16
      for(i=0;i<16;i+=2) {
         sample += (*nextD++ * tms320av120[num].V[i  ][j   ]) >> 8;
         sample += (*nextD++ * tms320av120[num].V[i+1][j+32]) >> 8;
      }
      *pcmSamples++ = (INT16)(sample >> 1); // Output samples are 16 bit
   }
}

//Return bits from the frame buffer
static int GetBits(int num, int numBits) {
   int result;
   if(tms320av120[num].bitsRemaining == 0) { // If no bits in this byte get from next byte in frame buffer!
      tms320av120[num].fb_pos++;             // ...
	  //Make sure we're not out of data!
	  if(tms320av120[num].fb_pos >= MPG_FRAMESIZE) {
		  LOG(("END OF FRAME BUFFER DATA IN GETBITS!\n"));
		  return 0;
	  }
      tms320av120[num].bitsRemaining = 8;
   }
   if(tms320av120[num].bitsRemaining >= numBits) { // Can I fill it from this byte?
      tms320av120[num].bitsRemaining -= numBits;
      return (tms320av120[num].framebuff[tms320av120[num].fb_pos]>>tms320av120[num].bitsRemaining) & bitmasks[numBits];
   }
   // Use up rest of this byte, then recurse to get more bits
   result = (int)(tms320av120[num].framebuff[tms320av120[num].fb_pos] & bitmasks[tms320av120[num].bitsRemaining]) << (numBits - tms320av120[num].bitsRemaining);
   numBits -= tms320av120[num].bitsRemaining; // I don't need as many bits now
   tms320av120[num].bitsRemaining = 8;  // Move to next bit
   tms320av120[num].fb_pos++;
   //Make sure we're not out of data!
   if(tms320av120[num].fb_pos >= MPG_FRAMESIZE) {
	  LOG(("END OF FRAME BUFFER DATA IN GETBITS!\n"));
	  return 0;
   }
   return result | GetBits(num,numBits);
}

//Decode an MPEG1 - Layer 2 Frame
static void DecodeLayer2(int num)
{
int allocation[32];				// One set of allocation data for each subband
int scaleFactorSelection[32];	// One set of scale factor selectors for each subband
int sbSamples[3][32];			// Three sets/groups of subband samples for each of the 32 Subbands
int scaleFactor[3][32];			// Scale factors for each of the 3 groups of 32 Subbands
int sblimit=0;					// One past highest subband with non-empty allocation
int sb, sf, gp;

//Reset bits flag
tms320av120[num].bitsRemaining = 8;

// Retrieve allocation for each of the 32 Subbands
for(sb=0;sb<32;sb++) {
   if(Layer2AllocationB2d[sb]) {
        allocation[sb] = GetBits(num,Layer2AllocationB2d[sb]);
        if(allocation[sb] && (sb >= sblimit))
           sblimit=sb+1;
   } else
        allocation[sb] = 0;
}

// Retrieve scale factor selection information for each of the 32 subbands (skip non-used subbands)
for(sb=0; sb<sblimit; sb++)
	if(allocation[sb] != 0)
		scaleFactorSelection[sb] = GetBits(num,2);

// Read scale factors, using scaleFactorSelection to determine which scale factors apply to more than one group
for(sb=0; sb<sblimit; sb++)
{
    if(allocation[sb] != 0) {
       switch(scaleFactorSelection[sb]) {
       case 0: // Three scale factors
            scaleFactor[0][sb] = GetBits(num,6);
            scaleFactor[1][sb] = GetBits(num,6);
            scaleFactor[2][sb] = GetBits(num,6);
            break;
       case 1: // One for first two-thirds, one for last third
            scaleFactor[0][sb] = GetBits(num,6);
            scaleFactor[1][sb] = scaleFactor[0][sb];
            scaleFactor[2][sb] = GetBits(num,6);
            break;
       case 2: // One for all three
            scaleFactor[0][sb] = GetBits(num,6);
            scaleFactor[1][sb] = scaleFactor[0][sb];
            scaleFactor[2][sb] = scaleFactor[0][sb];
            break;
       case 3: // One for first third, one for last two-thirds
            scaleFactor[0][sb] = GetBits(num,6);
            scaleFactor[1][sb] = GetBits(num,6);
            scaleFactor[2][sb] = scaleFactor[1][sb];
            break;
	   }
	}
}

for(sf=0;sf<3;sf++) { // Diff't scale factors for each 1/3
	for(gp=0;gp<4;gp++) { // 4 groups of samples in each 1/3

		for(sb=0;sb<sblimit;sb++) { // Read 3 sets of 32 subband samples (skip non-used subbands)
			if(!allocation[sb] || !Layer2AllocationB2d[sb]) { // No bits, store zero for each set
				sbSamples[0][sb] = 0;
				sbSamples[1][sb] = 0;
				sbSamples[2][sb] = 0;
			}
			else {
				const Layer2QuantClass quantClass = l2allocationE[allocation[sb]];
				int scale_factor = scaleFactor[sf][sb];	//Grab current scale factor for sf group and subband
				int levels = quantClass._levels;		//Quantization level
				int width = quantClass._bits;
				int s = GetBits(num,width);      //Get group / 1st sample
				if (quantClass._grouping) { // Grouped samples
					// Separate out by computing successive remainders
					sbSamples[0][sb] = Layer2Requant(s % levels,levels,scale_factor);
					s /= levels;
					sbSamples[1][sb] = Layer2Requant(s % levels,levels,scale_factor);
					s /= levels;
					sbSamples[2][sb] = Layer2Requant(s % levels,levels,scale_factor);
				}
				else { // Ungrouped samples
					sbSamples[0][sb] = Layer2Requant(s,levels,scale_factor);
					s = GetBits(num,width); // Get 2nd sample
					sbSamples[1][sb] = Layer2Requant(s,levels,scale_factor);
					s = GetBits(num,width); // Get 3rd sample
					sbSamples[2][sb] = Layer2Requant(s,levels,scale_factor);
				}
			}
		}
		// Now, feed three sets of subband samples into synthesis engine
		Layer12Synthesis(num,sbSamples[0],sblimit);
		tms320av120[num].pcm_pos += 32;
		Layer12Synthesis(num,sbSamples[1],sblimit);
		tms320av120[num].pcm_pos += 32;
		Layer12Synthesis(num,sbSamples[2],sblimit);
		tms320av120[num].pcm_pos += 32;
	}	//# of groups
}		//# of scale factors
}

static int get_sound_buffer_consumed(int chipnum)
{
	if (tms320av120[chipnum].pcm_pos >= tms320av120[chipnum].sOut)
		return tms320av120[chipnum].pcm_pos - tms320av120[chipnum].sOut;
	// Else tail has looped around, need to add buffer size.
	return tms320av120[chipnum].pcm_pos + CAP_PCMBUFFER_SIZE - tms320av120[chipnum].sOut;
}

/**********************************************************************************************
     tms320av120_update -- output samples to the stream buffer
***********************************************************************************************/
static void tms320av120_update(int num, INT16 *buffer, int length)
{
 int ii=0;

 //Pre-buffer must be full to process pcm data
 if(tms320av120[num].prebuff_full)	
 {
	/* fill in with samples until we hit the end or run out */
	for (ii = 0; ii < length; ii++) {
		//Ready to receive more data?
		if (get_sound_buffer_consumed(num) < CAP_PCMBUFFER_SIZE - 1152 ) {
			//Flag SREQ LO to request more data to come in!
			set_sreq_line(num,0);
		}
		//No more data ready for output, so abort
		if (tms320av120[num].sOut == tms320av120[num].pcm_pos){
			tms320av120[num].prebuff_full = 0;
			tms320av120[num].sOut = 0;
			tms320av120[num].pcm_pos = 0;
			if(tms320av120[num].found_header)
				LOG(("TMS320AV120 #%d: No more pcm samples ready for output, skipping %d \n",num,length-ii));
			break;
		}
		//Send next pcm sample to output buffer (mute if it is set)
		buffer[ii] = (!tms320av120[num].mute) ? tms320av120[num].pcmbuffer[tms320av120[num].sOut] : (INT16)0;
		tms320av120[num].sOut++;
		//Loop to beginning if we reach end of pcm buffer
		if( tms320av120[num].sOut == CAP_PCMBUFFER_SIZE)
			tms320av120[num].sOut = 0;
	}
 }

 /* fill the rest with the silence */
 for ( ; ii < length; ii++)
	buffer[ii] = 0;
}

/**********************************************************************************************
     TMS320AV120_sh_start -- start emulation of the TMS320AV120
***********************************************************************************************/
int TMS320AV120_sh_start(const struct MachineSound *msound)
{
	int i, j, failed=0;

	//Get reference to the interface
	intf = msound->sound_interface;

	/* initialize the chips */
	memset(tms320av120, 0, sizeof(tms320av120));
	for (i = 0; i < intf->num; i++)
	{
		char stream_name[40];
		/*-- allocate a DAC stream at 32KHz --*/
		sprintf(stream_name, "%s #%d", sound_name(msound), i);
		tms320av120[i].stream = stream_init(stream_name, intf->mixing_level[i], 32000, i, tms320av120_update);

		//Fail if stream not created
		failed = (tms320av120[i].stream < 0);

		if(failed) break;

		//Open for logging data
		#if LOG_DATA_IN	
		fp = fopen("c:\\tms320av120.mp3","wb");
		#endif
	}

