vpinball/pinmame/src/sound/tms320av120.c
	if(!failed) {
		int *nextD = D;

		//Create Scale Factor values
		for(i=0;i<64;i++) //!! is the value for layer1ScaleFactors[63] correct?
			layer1ScaleFactors[i] = (int)(32767.0 * exp2(1.0 - i/3.0));
		// For speed, precompute all of the phase shift values
		for(i=0;i<32;i++) { // 1.14
         phaseShiftsR[i] = (int)(16384.0*cos(i*(M_PI/32.0)));
         phaseShiftsI[i] = (int)(16384.0*sin(i*(M_PI/32.0)));
         vShiftR[i] = (int)(16384.0*cos((32+i)*(M_PI/64.0)));
         vShiftI[i] = (int)(16384.0*sin((32+i)*(M_PI/64.0)));
		}
		// Rearrange synthesis window coefficients into a more
		// useful order, and scale them to 3.12
		for(j=0;j<32;j++)
         for(i=0;i<16;i+=2) {
            *nextD++ = SynthesisWindowCoefficients[j+32*i]>>4;
            *nextD++ = SynthesisWindowCoefficients[j+32*i+32]>>4;
		 }
	}
	return failed;
}


/**********************************************************************************************
     TMS320AV120_sh_stop -- stop emulation of the TMS320AV120
***********************************************************************************************/

void TMS320AV120_sh_stop(void)
{
  //Close logging file
  #if LOG_DATA_IN
  if(fp)	fclose(fp);
  #endif
}

/**********************************************************************************************
     TMS320AV120_sh_reset -- reset emulation of the TMS320AV120
***********************************************************************************************/

void TMS320AV120_sh_reset(void)
{
	int i;
	//Reset all chips - force a transition from active to reset, then reset to active
	for (i = 0; i < intf->num; i++) {
		tms320av120[i].reset = 0;
		TMS320AV120_set_reset(i,1);
		tms320av120[i].reset = 1;
		TMS320AV120_set_reset(i,0);
	}
}

/**********************************************************************************************
     TMS320AV120_sh_update -- called after every video frame
***********************************************************************************************/
void TMS320AV120_sh_update(void)
{
}

/**********************************************************************************************
     set_bof_line -- set's the state of the /BOF line
***********************************************************************************************/
static void set_bof_line(int chipnum, int state)
{
	//Keep track of what we set..
	tms320av120[chipnum].bof_line = state;
	//Call our callback if there is one
	if(intf->bof_line) intf->bof_line(chipnum,state);
}
/**********************************************************************************************
     set_sreq_line -- set's the state of the /SREQ line
***********************************************************************************************/
static void set_sreq_line(int chipnum, int state)
{
	//Keep track of what we set..
	tms320av120[chipnum].sreq_line = state;
	//Call our callback if there is one
	if(intf->sreq_line) intf->sreq_line(chipnum,state);
}

/**********************************************************************************************
     TMS320AV120_set_mute -- set/clear mute pin
***********************************************************************************************/
void TMS320AV120_set_mute(int chipnum, int state)
{
	//Act only on change of state
	if(state == tms320av120[chipnum].mute) return;
	//Update state
	tms320av120[chipnum].mute = state;
	//LOG(("TMS320AV120 #%d mute line set to %d!\n",chipnum,state));
}

/**********************************************************************************************
	TMS320AV120_set_reset -- set/clear reset pin
***********************************************************************************************/
void TMS320AV120_set_reset(int chipnum, int state)
{
	//Act only on change of state
	if(state == tms320av120[chipnum].reset) return;

	//LOG(("TMS320AV120 #%d reset line set to %d!\n",chipnum,state));

	//Transition from active to reset?
	if(!tms320av120[chipnum].reset && state)
	{
		//BOF & SREQ Line set to 1
		set_bof_line(chipnum,1);
		set_sreq_line(chipnum,1);
		//Mute is set
		tms320av120[chipnum].mute = 1;
		//Clear buffers
		tms320av120[chipnum].found_header = 0;
		tms320av120[chipnum].fb_pos = 0;
		tms320av120[chipnum].pcm_pos = 0;
		tms320av120[chipnum].prebuff_full = 0;
		tms320av120[chipnum].sOut = 0;
	}

	//Transition from reset to active?
	if(tms320av120[chipnum].reset && !state)
	{
		//SREQ Line set to 0
		set_sreq_line(chipnum,0);
		//Mute turned off
		tms320av120[chipnum].mute = 0;
	}

	//Update state
	tms320av120[chipnum].reset = state;
}

/**********************************************************************************************
     valid header? -- 4 bytes need to be: ff,fd,18 (or 19), c0
	 //NOTE: These are hardcoded to our specific sampling rate/bit rate, and other factors
***********************************************************************************************/
static int valid_header(int chipnum)
{
	if(tms320av120[chipnum].framebuff[tms320av120[chipnum].fb_pos-4] == 0xff)
		if(tms320av120[chipnum].framebuff[tms320av120[chipnum].fb_pos-3] == 0xfd)
			if(tms320av120[chipnum].framebuff[tms320av120[chipnum].fb_pos-2] == 0x18 ||
			   tms320av120[chipnum].framebuff[tms320av120[chipnum].fb_pos-2] == 0x19)
					if(tms320av120[chipnum].framebuff[tms320av120[chipnum].fb_pos-1] == 0xc0)
						return 1;
	return 0;
}

/**********************************************************************************************
     TMS320AV120_data_w -- writes data to the chip and processes data
***********************************************************************************************/
WRITE_HANDLER( TMS320AV120_data_w )
{
	int chipnum = offset;

	//Safety check
	if( (intf->num-1) < chipnum) {
		//LOG(("TMS320AV120_DATA_W: Error trying to send data to undefined chip #%d\n",offset));
		return;
	}

	#if LOG_DATA_IN	
	//Log it for channel 0
	if(offset==0)
		if(fp) fputc(data,fp);
	#endif

	//ABORT IF SREQ HIGH!
	if(tms320av120[chipnum].sreq_line)	
	{
		LOG(("TMS320AV120 #%d: SREQ HI - Data Ignored!\n",chipnum));
		return;
	}

	//Write to input buffer
	tms320av120[chipnum].framebuff[tms320av120[chipnum].fb_pos++] = data;
	
	//If we don't have a header start looking once we have read enough bytes for one
	if(!tms320av120[chipnum].found_header && tms320av120[chipnum].fb_pos > MPG_HEADERSIZE-1)
	{
		//Reset BOF line
		set_bof_line(chipnum,1);
		tms320av120[chipnum].found_header = valid_header(chipnum);
		if (!tms320av120[chipnum].found_header)
		{
			// Shift byte down one so we don't miss a header entirely reading in 4 byte chunks.
			int i;
			for (i = 0; i < 3; i++)
				tms320av120[chipnum].framebuff[i] = tms320av120[chipnum].framebuff[i + 1];
			tms320av120[chipnum].fb_pos--;
		}
		else
			tms320av120[chipnum].fb_pos=0;	//Overwrite the header since we don't need it
	}

	//Once we have a valid header, see if we've got an entire frame
	if(tms320av120[chipnum].found_header && (tms320av120[chipnum].fb_pos == MPG_FRAMESIZE))
	{
		/*-- WE HAVE 1 FRAME --*/

		//Reset Frame Buffer position for reading
		tms320av120[chipnum].fb_pos = 0;

		//Decode the frame (generates 1152 pcm samples)
		DecodeLayer2(chipnum);		 //note: tms320av120[chipnum].pcm_pos will be adjusted +1152 inside the decode function

		//Do we now have enough pre-buffer to begin?
		if(tms320av120[chipnum].pcm_pos == CAP_PREBUFFER_SIZE)
			tms320av120[chipnum].prebuff_full = 1;

		//Start over for next round if we're at the end of the buffer now!
		if(tms320av120[chipnum].pcm_pos == CAP_PCMBUFFER_SIZE)
			tms320av120[chipnum].pcm_pos=0;

		// If our buffer is full, signal to stop sending data
		if(get_sound_buffer_consumed(chipnum) >= CAP_PCMBUFFER_SIZE-1152)
		{
			//Flag SREQ HI to stop data coming in!
			set_sreq_line(chipnum,1);
		}

		//Reset flag to search for next header
		tms320av120[chipnum].found_header = 0;

		//Reset frame buffer for next header
		tms320av120[chipnum].fb_pos = 0;

		//Set BOF Line low
		set_bof_line(chipnum,0);

		//Force stream to update
		//stream_update(tms320av120[chipnum].stream, 0);
	}
}
